app/Services/CartService.php

    public function getCartCount(): int
    {
        if (Auth::check()) {
            return CartItem::where('user_id', Auth::id())->sum('quantity');
---
select sum(`quantity`) as aggregate from `cart_items` where `user_id` = 1

    public function clearCart(): void
    {
        if (Auth::check()) {
            CartItem::where('user_id', Auth::id())->delete();
---
delete from `cart_items` where `user_id` = 1

    private function addToUserCart(int $productId, int $quantity): array
    {
        $product = Product::find($productId);
        if (!$product) {
            return ['success' => false, 'message' => 'Product not found'];
        }

        if ($product->stock_quantity < $quantity) {
            return ['success' => false, 'message' => 'Insufficient stock'];
        }

        $cartItem = CartItem::where('user_id', Auth::id())
            ->where('product_id', $productId)
            ->first();

        if ($cartItem) {
            $newQuantity = $cartItem->quantity + $quantity;
            if ($product->stock_quantity < $newQuantity) {
                return ['success' => false, 'message' => 'Insufficient stock'];
            }
            $cartItem->update(['quantity' => $newQuantity]);
        } else {
            CartItem::create([
                'user_id' => Auth::id(),
                'product_id' => $productId,
                'quantity' => $quantity
            ]);
---
select * from `products` where `products`.`id` = 261 limit 1
select * from `cart_items` where `user_id` = 1 and `product_id` = 261 limit 1
insert into `cart_items` (`user_id`, `product_id`, `quantity`, `updated_at`, `created_at`) values (1, 261, 1, '2025-07-29 20:56:43', '2025-07-29 20:56:43')

    private function getUserCartItems(): array
    {
        $cartItems = CartItem::with('product.images')
            ->where('user_id', Auth::id())
            ->get();

        return $cartItems->map(function ($item) {
            return [
                'id' => $item->id,
                'product_id' => $item->product_id,
                'product' => $item->product,
                'quantity' => $item->quantity,
                'unit_price' => $item->unit_price,
                'total_price' => $item->total_price,
                'product_title' => $item->product->title,
                'product_image' => $this->getProductImage($item->product),
                'product_url' => route('buyer.product.show', $item->product->slug),
            ];
        })->toArray();
---
select * from `cart_items` where `user_id` = 1
select * from `products` where `products`.`id` in (261, 262, 263)
select * from `product_images` where `product_images`.`product_id` in (261, 262, 263)