routes/web.php

// Ad view tracking
Route::post('/ad-track/view', function () {
    $adId = request('seller_ad_id');
    $ad = \App\Models\SellerAd::find($adId);
---
select * from `seller_ads` where `seller_ads`.`id` = 4 limit 1