app/Http/Controllers/CheckoutController.php

select * from `user_addresses` where `user_addresses`.`user_id` = 1 and `user_addresses`.`user_id` is not null
---
    public function index()
    {
        $cartItems = $this->cartService->getCartItems();
        $cartTotal = $this->cartService->getCartTotal();
        $cartCount = $this->cartService->getCartCount();

        // Redirect to cart if empty
        if (empty($cartItems)) {
            return redirect()->route('cart.index')->with('error', 'Your cart is empty. Please add some items before checkout.');
        }

        // Get user's addresses if authenticated
        $addresses = [];
        $defaultAddress = null;
        if (Auth::check()) {
            $addresses = Auth::user()->addresses()->get();

insert into `orders` (`order_number`, `user_id`, `shipping_address_id`, `total_price`, `discount_amount`, `shipping_cost`, `tax_amount`, `final_price`, `status`, `shipping_method`, `notes`, `updated_at`, `created_at`) values ('TEMP-1753814669-2150', 1, '2', 45400, 0, 1000, 0, 46400, 'pending', 'standard', null, '2025-07-29 18:44:29', '2025-07-29 18:44:29')
update `orders` set `order_number` = 'ORD-2025-000002', `orders`.`updated_at` = '2025-07-29 18:44:29' where `id` = 2
select * from `products` where `products`.`id` = 256 limit 1
insert into `order_items` (`order_id`, `product_id`, `quantity`, `price`, `discount_amount`, `updated_at`, `created_at`) values (2, 256, 1, '4000.00', 0, '2025-07-29 18:44:29', '2025-07-29 18:44:29')
update `products` set `stock_quantity` = `stock_quantity` - 1, `products`.`updated_at` = '2025-07-29 18:44:29' where `id` = 256
---
            }

            // Create order with temporary order number
            $order = Order::create([
                'order_number' => 'TEMP-' . time() . '-' . rand(1000, 9999), // Temporary unique number
                'user_id' => Auth::id(),
                'shipping_address_id' => $shippingAddressId,
                'total_price' => $subtotal,
                'discount_amount' => 0,
                'shipping_cost' => $shippingCost,
                'tax_amount' => $taxAmount,
                'final_price' => $finalTotal,
                'status' => 'pending',
                'shipping_method' => 'standard',
                'notes' => $request->additional_info,
            ]);

            // Generate proper order number
            $order->update([
                'order_number' => $order->generateOrderNumber()
            ]);

            // Create order items
            foreach ($cartItems as $item) {
                $product = Product::find($item['product_id']);
                if ($product) {
                    OrderItem::create([
                        'order_id' => $order->id,
                        'product_id' => $product->id,
                        'quantity' => $item['quantity'],
                        'price' => $product->price_discounted > 0 ? $product->price_discounted : $product->price_regular,
                        'discount_amount' => 0,
                    ]);

                    // Update product stock
                    $product->decrement('stock_quantity', $item['quantity']);