app/Http/Controllers/Buyer/DashboardController.php

    public function index()
    {
        $user = Auth::user();

        $stats = [
            'total_orders' => $user->orders()->count(),
            'pending_orders' => $user->orders()->where('status', 'pending')->count(),
            'completed_orders' => $user->orders()->where('status', 'delivered')->count(),
            'wishlist_items' => $user->wishlist()->count(),
            'addresses' => $user->addresses()->count(),
            'return_requests' => $user->returnRequests()->count(),
        ];

        $recent_orders = $user->orders()
            ->with(['orderItems.product'])
            ->latest()
            ->take(5)
            ->get();
---
select count(*) as aggregate from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null and `status` = 'pending'
select count(*) as aggregate from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null and `status` = 'delivered'
select count(*) as aggregate from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null
select count(*) as aggregate from `wishlists` where `wishlists`.`user_id` = 1 and `wishlists`.`user_id` is not null
select count(*) as aggregate from `user_addresses` where `user_addresses`.`user_id` = 1 and `user_addresses`.`user_id` is not null
select count(*) as aggregate from `return_requests` where `return_requests`.`user_id` = 1 and `return_requests`.`user_id` is not null
select * from `order_items` where `order_items`.`order_id` in (1, 2)
select * from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null order by `created_at` desc limit 5
select * from `products` where `products`.`id` in (256, 259, 262, 266, 268, 272)

    public function addresses()
    {
        $addresses = Auth::user()->addresses()->latest()->get();
---
select * from `user_addresses` where `user_addresses`.`user_id` = 1 and `user_addresses`.`user_id` is not null order by `created_at` desc

    public function orders()
    {
        $orders = Auth::user()->orders()
            ->with(['orderItems.product', 'shippingAddress', 'statusLogs'])
            ->latest()
            ->paginate(10);
---
select * from `order_items` where `order_items`.`order_id` in (1, 2)
select * from `order_status_logs` where `order_status_logs`.`order_id` in (1, 2)
select * from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null order by `created_at` desc limit 10 offset 0
select * from `products` where `products`.`id` in (256, 259, 262, 266, 268, 272)

    public function orderDetails(Order $order)
    {
        // Ensure user owns this order
        if ($order->user_id !== Auth::id()) {
            abort(403);
        }

        $order->load([
            'orderItems.product',
            'shippingAddress',
            'statusLogs' => function ($query) {
                $query->latest();
            },
            'coupon'
        ]);
---
select * from `order_items` where `order_items`.`order_id` in (2)
select * from `order_status_logs` where `order_status_logs`.`order_id` in (2) order by `created_at` desc
select * from `products` where `products`.`id` in (256, 259, 262, 268)
select * from `user_addresses` where `user_addresses`.`id` in (2)

    public function wishlist()
    {
        $wishlistItems = Auth::user()->wishlist()
            ->with('product')
            ->latest()
            ->paginate(12);
---
select count(*) as aggregate from `wishlists` where `wishlists`.`user_id` = 1 and `wishlists`.`user_id` is not null

    public function returnRequests()
    {
        $returnRequests = Auth::user()->returnRequests()
            ->with(['order', 'orderItem.product'])
            ->latest()
            ->paginate(10);
---
select count(*) as aggregate from `return_requests` where `return_requests`.`user_id` = 1 and `return_requests`.`user_id` is not null

    public function cart()
    {
        $cartItems = $this->cartService->getCartItems();
        $subtotal = $this->cartService->getCartTotal();

        // Calculate cart totals breakdown
        $shipping = 1000; // Fixed shipping cost of 1000 DJF
        $tax = 0; // No tax for now
        $total = $subtotal + $shipping + $tax;

        $cartTotal = [
            'subtotal' => $subtotal,
            'shipping' => $shipping,
            'tax' => $tax,
            'total' => $total
        ];

        // Get recommended products (random products for now)
        $recommendedProducts = \App\Models\Product::where('status', 'active')
            ->inRandomOrder()
            ->limit(3)
            ->get();
---
select * from `products` where `status` = 'active' order by RAND() limit 3

    public function tracking()
    {
        $orders = Auth::user()->orders()
            ->where('status', '!=', 'delivered')
            // ->whereNotNull('tracking_number')
            ->with(['orderItems.product'])
            ->latest()
            ->paginate(10);
---
select * from `order_items` where `order_items`.`order_id` in (1, 2)
select * from `products` where `products`.`id` in (256, 259, 262, 266, 268, 272)

    public function downloadInvoice(Order $order)
    {
        // Ensure user owns this order
        if ($order->user_id !== Auth::id()) {
            abort(403);
        }

        $order->load(['orderItems.product', 'shippingAddress', 'user']);
---
select * from `order_items` where `order_items`.`order_id` in (1)
select * from `products` where `products`.`id` in (266, 272)
select * from `user_addresses` where `user_addresses`.`id` in (2)
select * from `users` where `users`.`id` in (1)