app/Http/Controllers/Buyer/HomeController.php

select * from `categories` where `categories`.`id` in (6, 8, 13, 18, 20, 27, 39, 40)
select * from `products` where `status` = 'published' order by `created_at` desc limit 12
---
    public function index()
    {
        // Fetch latest 9 products for new arrivals section
        $newArrivals = Product::with(['category', 'reviews'])
            ->where('status', 'published')
            ->orderBy('created_at', 'desc')
            ->take(12)
            ->get();

select `products`.*, COALESCE(SUM(order_items.quantity), 0) as total_sold from `products` left join `order_items` on `products`.`id` = `order_items`.`product_id` left join `orders` on `order_items`.`order_id` = `orders`.`id` and `orders`.`status` in ('completed', 'delivered') where `products`.`status` = 'active' group by `products`.`id` order by `total_sold` desc, `products`.`created_at` desc limit 9
---
    private function getBestSellingProducts($limit = 10, $days = null)
    {
        $query = Product::select([
            'products.*',
            DB::raw('COALESCE(SUM(order_items.quantity), 0) as total_sold')
        ])
            ->leftJoin('order_items', 'products.id', '=', 'order_items.product_id')
            ->leftJoin('orders', function ($join) {
                $join->on('order_items.order_id', '=', 'orders.id')
                    ->whereIn('orders.status', ['completed', 'delivered']); // Only count completed sales
            })
            ->where('products.status', 'active')
            ->with(['category', 'reviews']);

        // Optional: Filter by date range (e.g., last 30 days)
        if ($days) {
            $query->where('orders.created_at', '>=', now()->subDays($days));
        }

        return $query->groupBy('products.id')
            ->orderByDesc('total_sold')
            ->orderByDesc('products.created_at') // Secondary sort for products with same sales
            ->take($limit)
            ->get();

select * from `flash_sales` where `status` = 1 and `start_at` <= '2025-07-30 05:22:20' and `end_at` > '2025-07-30 05:22:20'
---
    private function getFlashSalesProducts($limit = 8)
    {
        // Get only currently active flash sales (not expired)
        $activeFlashSales = FlashSale::where('status', FlashSale::STATUS_ACTIVE)
            ->where('start_at', '<=', now())
            ->where('end_at', '>', now()) // Changed from >= to > to exclude expired sales
            ->with(['products' => function ($query) {
                $query->where('status', 'published')
                    ->with(['category', 'reviews']);
            }])
            ->get();

select exists(select * from `campaigns` where `is_active` = 1 and `start_date` <= '2025-07-30 05:22:20' and `end_date` >= '2025-07-30 05:22:20') as `exists`
---
    private function getCampaignsProducts($limit = 20)
    {
        // Check if any campaigns exist
        $campaigns = Campaign::where('is_active', true)
            ->where('start_date', '<=', now())
            ->where('end_date', '>=', now())
            ->exists();

select `products`.*, (price_regular - price_discounted) as discount_amount, ROUND(((price_regular - price_discounted) / price_regular) * 100, 2) as discount_percentage from `products` where `status` = 'active' and `price_discounted` is not null and `price_discounted` < `price_regular` and (price_regular - price_discounted) > 0 order by `discount_amount` desc, `discount_percentage` desc, `created_at` desc limit 20
---
    private function getTopDiscountsProducts($limit = 20)
    {
        return Product::select([
            'products.*',
            DB::raw('(price_regular - price_discounted) as discount_amount'),
            DB::raw('ROUND(((price_regular - price_discounted) / price_regular) * 100, 2) as discount_percentage')
        ])
            ->where('status', 'active')
            ->whereNotNull('price_discounted')
            ->whereColumn('price_discounted', '<', 'price_regular')
            ->where(DB::raw('(price_regular - price_discounted)'), '>', 0)
            ->with(['category', 'reviews'])
            ->orderByDesc('discount_amount')
            ->orderByDesc('discount_percentage')
            ->orderByDesc('created_at')
            ->take($limit)
            ->get();

select * from `promotions` where `start_at` > '2025-07-30 23:59:59' and `is_active` = 1
---
    private function getUpcomingDealsProducts($limit = 25)
    {
        // Get promotions that start from tomorrow onward
        $upcomingPromotions = Promotion::where('start_at', '>', now()->endOfDay())
            ->where('is_active', true)
            ->with(['products' => function ($query) {
                $query->where('status', 'active')
                    ->with(['category', 'reviews']);
            }])
            ->get();

select `products`.*, COUNT(product_reviews.id) as reviews_count from `products` left join `product_reviews` on `products`.`id` = `product_reviews`.`product_id` where `products`.`status` = 'active' group by `products`.`id` having `reviews_count` > 0 order by `reviews_count` desc, `products`.`created_at` desc limit 40
---
    private function getMostReviewedProducts($limit = 20)
    {
        return Product::select([
            'products.*',
            DB::raw('COUNT(product_reviews.id) as reviews_count')
        ])
            ->leftJoin('product_reviews', 'products.id', '=', 'product_reviews.product_id')
            ->where('products.status', 'active')
            ->with(['category', 'reviews'])
            ->groupBy('products.id')
            ->having('reviews_count', '>', 0)
            ->orderByDesc('reviews_count')
            ->orderByDesc('products.created_at')
            ->take($limit * 2) // Get more to randomize
            ->get()
            ->shuffle()
            ->take($limit);

select `products`.*, AVG(product_reviews.rating) as average_rating, COUNT(product_reviews.id) as reviews_count from `products` left join `product_reviews` on `products`.`id` = `product_reviews`.`product_id` where `products`.`status` = 'active' group by `products`.`id` having `reviews_count` >= 3 and `average_rating` >= 4 order by `average_rating` desc, `reviews_count` desc, `products`.`created_at` desc limit 40
---
    private function getTopRatedProducts($limit = 20)
    {
        return Product::select([
            'products.*',
            DB::raw('AVG(product_reviews.rating) as average_rating'),
            DB::raw('COUNT(product_reviews.id) as reviews_count')
        ])
            ->leftJoin('product_reviews', 'products.id', '=', 'product_reviews.product_id')
            ->where('products.status', 'active')
            ->with(['category', 'reviews'])
            ->groupBy('products.id')
            ->having('reviews_count', '>=', 3) // Minimum 3 reviews for reliability
            ->having('average_rating', '>=', 4.0) // Minimum 4 stars average
            ->orderByDesc('average_rating')
            ->orderByDesc('reviews_count')
            ->orderByDesc('products.created_at')
            ->take($limit * 2) // Get more to randomize
            ->get()
            ->shuffle()
            ->take($limit);

select `categories`.`id`, `categories`.`name`, `categories`.`slug` from `categories` inner join `categories` as `subcategories` on `categories`.`id` = `subcategories`.`parent_id` group by `categories`.`id`, `categories`.`name`, `categories`.`slug` order by COUNT(subcategories.id) DESC limit 1
select * from `categories` where `parent_id` = 57 limit 10
---
    private function getMostReferencedCategoryData()
    {
        // Find the most referenced parent category
        $mostReferencedParent = Category::select('categories.id', 'categories.name', 'categories.slug')
            ->join('categories as subcategories', 'categories.id', '=', 'subcategories.parent_id')
            ->groupBy('categories.id', 'categories.name', 'categories.slug')
            ->orderByRaw('COUNT(subcategories.id) DESC')
            ->first();

        if (!$mostReferencedParent) {
            // Fallback: get any category with children
            $mostReferencedParent = Category::has('children')->first();

select `categories`.`id`, `categories`.`name`, `categories`.`slug` from `categories` inner join `categories` as `subcategories` on `categories`.`id` = `subcategories`.`parent_id` group by `categories`.`id`, `categories`.`name`, `categories`.`slug` order by COUNT(subcategories.id) DESC limit 2
select * from `categories` where `parent_id` = 57 limit 10
---
    private function getSecondMostReferencedCategoryData()
    {
        // Find the top 2 most referenced parent categories
        $topParentCategories = Category::select('categories.id', 'categories.name', 'categories.slug')
            ->join('categories as subcategories', 'categories.id', '=', 'subcategories.parent_id')
            ->groupBy('categories.id', 'categories.name', 'categories.slug')
            ->orderByRaw('COUNT(subcategories.id) DESC')
            ->take(2)
            ->get();

        // Get the second one if available, otherwise get any other category with children
        $secondMostReferencedParent = $topParentCategories->count() > 1
            ? $topParentCategories->get(1)
            : Category::has('children')
            ->whereNotIn('id', $topParentCategories->pluck('id'))
            ->first();

        if (!$secondMostReferencedParent) {
            // Ultimate fallback: get any category with children
            $secondMostReferencedParent = Category::has('children')->first();

select `categories`.`id`, `categories`.`name`, `categories`.`slug` from `categories` inner join `categories` as `subcategories` on `categories`.`id` = `subcategories`.`parent_id` group by `categories`.`id`, `categories`.`name`, `categories`.`slug` order by COUNT(subcategories.id) DESC limit 3
select * from `categories` where `parent_id` = 66 limit 10
---
    private function getThirdMostReferencedCategoryData()
    {
        // Find the top 3 most referenced parent categories
        $topParentCategories = Category::select('categories.id', 'categories.name', 'categories.slug')
            ->join('categories as subcategories', 'categories.id', '=', 'subcategories.parent_id')
            ->groupBy('categories.id', 'categories.name', 'categories.slug')
            ->orderByRaw('COUNT(subcategories.id) DESC')
            ->take(3)
            ->get();

        // Get the third one if available, otherwise get any other category with children
        $thirdMostReferencedParent = $topParentCategories->count() > 2
            ? $topParentCategories->get(2)
            : Category::has('children')
            ->whereNotIn('id', $topParentCategories->pluck('id'))
            ->first();

        if (!$thirdMostReferencedParent) {
            // Ultimate fallback: get any category with children
            $thirdMostReferencedParent = Category::has('children')->first();

select `categories`.`id`, `categories`.`name`, `categories`.`slug` from `categories` inner join `categories` as `subcategories` on `categories`.`id` = `subcategories`.`parent_id` group by `categories`.`id`, `categories`.`name`, `categories`.`slug` order by COUNT(subcategories.id) DESC limit 4
select * from `categories` where `parent_id` = 100 limit 10
---
    private function getFourthMostReferencedCategoryData()
    {
        // Find the top 4 most referenced parent categories
        $topParentCategories = Category::select('categories.id', 'categories.name', 'categories.slug')
            ->join('categories as subcategories', 'categories.id', '=', 'subcategories.parent_id')
            ->groupBy('categories.id', 'categories.name', 'categories.slug')
            ->orderByRaw('COUNT(subcategories.id) DESC')
            ->take(4)
            ->get();

        // Get the fourth one if available, otherwise get any other category with children
        $fourthMostReferencedParent = $topParentCategories->count() > 3
            ? $topParentCategories->get(3)
            : Category::has('children')
            ->whereNotIn('id', $topParentCategories->pluck('id'))
            ->first();

        if (!$fourthMostReferencedParent) {
            // Ultimate fallback: get any category with children
            $fourthMostReferencedParent = Category::has('children')->first();

select * from `sellers` where `sellers`.`id` in (1)
---
    private function getActiveAds()
    {
        $ads = SellerAd::active()
            ->with(['seller'])
            ->get()
            ->groupBy('ad_slot');