app/Models/Order.php

select * from `orders` where `id` = 2 limit 1
---
    public function resolveRouteBinding($value, $field = null)
    {
        try {
            $id = decrypt($value);
            return $this->where('id', $id)->first();

insert into `order_status_logs` (`status`, `message`, `estimated_delivery_time`, `order_id`, `updated_at`, `created_at`) values ('pending', 'Order has been placed and is awaiting processing.', null, 2, '2025-07-29 18:44:29', '2025-07-29 18:44:29')
---
    public function addStatusLog($status, $message = null, $estimatedDelivery = null)
    {
        return $this->statusLogs()->create([
            'status' => $status,
            'message' => $message,
            'estimated_delivery_time' => $estimatedDelivery,
        ]);