app/Models/SellerAd.php

update `seller_ads` set `current_views` = `current_views` + 1, `seller_ads`.`updated_at` = '2025-07-30 05:22:20' where `id` = 1
---
    protected function recordEvent(string $eventType, array $data = []): void
    {
        // Create stat record
        $this->stats()->create(array_merge([
            'event_type' => $eventType,
            'event_time' => now(),
            'user_ip' => request()->ip(),
            'user_agent' => request()->userAgent(),
            'session_id' => session()->getId(),
            'buyer_id' => Auth::check() ? Auth::id() : null,
            'referer_url' => request()->header('referer'),
            'page_url' => request()->fullUrl(),
        ], $data));

        // Update cached counters
        if ($eventType === 'view') {
            $this->increment('current_views');

update `seller_ads` set `current_cost` = 340, `seller_ads`.`updated_at` = '2025-07-30 05:22:20' where `id` = 1
---
    public function updateCost(): void
    {
        if ($this->pricing_type === self::PRICING_PER_VIEW) {
            $this->current_cost = $this->current_views * $this->per_view_rate;
        } else {
            // Daily pricing - calculate based on active days
            $startDate = $this->start_date;
            $endDate = $this->end_date ?? today();
            $activeDays = $startDate->diffInDays(min($endDate, today())) + 1;
            $this->current_cost = $activeDays * $this->daily_rate;
        }

        $this->save();