app/Models/User.php

select * from `user_addresses` where `user_addresses`.`user_id` = 1 and `user_addresses`.`user_id` is not null and `is_default` = 1 limit 1
---
    public function defaultAddress()
    {
        return $this->addresses()->where('is_default', true)->first();