app/Providers/AppServiceProvider.php

select * from `categories` where `categories`.`parent_id` in (1, 23, 56, 92, 116, 138, 160, 182, 204, 226, 248, 270, 292, 314, 336)
---
    public function boot(): void
    {
        // Observer registration moved to EventServiceProvider
        BusinessActivity::observe(BusinessActivityObserver::class);
        Category::observe(CategoryObserver::class);

        View::composer('layouts.app.partials.buyer.mega_menu', function ($view) {
            $megaMenuCategories = Category::whereNull('parent_id')
                ->with(['children.children']) // Eager load children and grandchildren
                ->get();
            $view->with('megaMenuCategories', $megaMenuCategories);
        });